2024-0307-02) 숫자자료 타입
 - NUMBER 타입이 제공됨
 (사용형식)
    컬럼명 NUMBER[(정밀도|*[스케일])]
    . '정밀도' : 전체 자리수 (1~38)
    . '스케일' : 소숫점 이하의 자리수
    . '스케일'이 생략되면 '0'으로 간주
    . 저장은 '스케일' + 1 번째 자리에서 반올림하여 '스케일'번째 까지 저장 (정수자리수 : 정밀도 - 스케일)
    . '스케일'이 음수이면 정수자리수에서 반올림 함
    . 값의 표현 범위 : 1.0E-130 ~ 9.9999...E+125
 (사용 예시)
 ----------------------------------------------------------------------------------------
    입력 값                선언                  기억되는 값
 ----------------------------------------------------------------------------------------
  12345.6789           NUMBER                 12345.6789
  12345.6789           NUMBER(*,2)            12345.68
  12345.6789           NUMBER(6,2)            오류
  12345.6789           NUMBER(7,2)            12345.68
  12345.6789           NUMBER(6,0)             12346
  12345.6789           NUMBER(6)               12346
  12345.6789           NUMBER(6,-2)            12300
 ----------------------------------------------------------------------------------------  
 
 CREATE TABLE TEMP05 (
    COL1    NUMBER,
    COL2    NUMBER(*,2),
    COL3    NUMBER(6,2),
    COL4    NUMBER(7,2),
    COL5    NUMBER(6,0),
    COL6    NUMBER(6),
    COL7    NUMBER(6,-2) );

INSERT INTO TEMP05 VALUES (12345.6789 ,12345.6789 ,45.6789 ,12345.6789 ,12345.6789 ,12345.6789 ,12345.6789 );

SELECT * FROM TEMP05;
